{
    "version": "https://jsonfeed.org/version/1",
    "title": "Audacious Fox",
    "home_page_url": "https://audaciousfox.net",
    "feed_url": "https://audaciousfox.net/",
    "icon" : "https://audaciousfox.net/apple-touch-icon.png",
    "favicon" : "https://audaciousfox.net/favicon.png",
    "author" : {
      "url" : "https://twitter.com/dreger",
      "name" : "K.Q. Dreger"
    },
    "items": [
    
        
            {
               
                "title": "Susan Fowler’s Year in Review",
                "external_url": "https://www.susanjfowler.com/blog/2019/12/10/my-year-in-review-2019",
                 
          "url": "https://audaciousfox.net/linked/2019/fowler-year-in-review/",
                "date_published": "2019-12-16T20:00:47-05:00",
                "id": "https://audaciousfox.net/linked/2019/fowler-year-in-review/",
                "author": {
                  "name" : "K.Q. Dreger"
                },
                "content_html": "\u003cp\u003eA wonderful writeup from one of my favorite editors. I particularly enjoyed this bit on the craft:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003eThis year was transformative for me as far as my writing skills are concerned. I got to the point where I can now sit down and knock out 3000-5000 \u003cem\u003egood\u003c/em\u003e words in one sitting, even when completely exhausted at the end of a long workday. My day job as an editor made all the difference here: since I’m so used to thinking of writing and editing as work, I no longer get writer’s block and writing has lost most of its mythical quality (which is a good thing, as far as I’m concerned). In addition to finishing my memoir, I also wrote a couple of pieces for the Times, two novels (which I am currently revising), and one very joyful screenplay.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eWriting is like working out—there\u0026rsquo;s no shortcut to putting in your reps.\u003c/p\u003e\n\u003cdiv\u003e\u003ca title=\"Permanent link for Susan Fowler’s Year in Review\" href='https://audaciousfox.net/linked/2019/fowler-year-in-review'\u003e\u0026nbsp;\u0026#9650;\u0026#65038;\u0026nbsp;\u003c/a\u003e\u003c/div\u003e\n"
            }
        
        , 
            {
              
                "title": "▲ Weekend Tweaks",
                 
          "url": "https://audaciousfox.net/2019/forgive-the-tests/",
                "date_published": "2019-12-14T20:44:22-05:00",
                "id": "https://audaciousfox.net/2019/forgive-the-tests/",
                "author": {
                  "name" : "K.Q. Dreger"
                },
                "content_html": "\u003cp\u003eI\u0026rsquo;m making a handful of changes to the site today, so please forgive any RSS oddities. Thanks.\u003c/p\u003e\n\u003cdiv\u003e\u003ca title=\"Permanent link for Weekend Tweaks\" href='https://audaciousfox.net/2019/forgive-the-tests'\u003e\u0026nbsp;\u0026#9650;\u0026#65038;\u0026nbsp;\u003c/a\u003e\u003c/div\u003e\n"
            }
        
        , 
            {
              
                "title": "▲ Treat Customer Pain Like Debt",
                 
          "url": "https://audaciousfox.net/2019/pain-snowball-method/",
                "date_published": "2019-12-14T12:58:56-05:00",
                "id": "https://audaciousfox.net/2019/pain-snowball-method/",
                "author": {
                  "name" : "K.Q. Dreger"
                },
                "content_html": "\u003cp\u003eDave Ramsey has this great method for paying off debt where you start with your highest interest loan, focus all of your extra income on that payment, and then once you\u0026rsquo;ve paid it off you \u003cem\u003esnowball\u003c/em\u003e that payment into the minimum payment of your next highest interest debt.\u003c/p\u003e\n\n\u003cp\u003eI think you can do something similar for products and user experience. Let\u0026rsquo;s call it The Pain Snowball Method.\u003c/p\u003e\n\n\u003cp\u003eStart by taking inventory of all the customer pain that\u0026rsquo;s been reported over the past month. Prioritize it based on what causes pain the most often. Take the top three reported pain points and dedicate time every week to finding solutions. Fix one of them, and then roll that time into the remaining two pain points until all three are resolved. Do it again next month.\u003c/p\u003e\n\n\u003cp\u003eAs your product grows, not every customer will use every feature. In order to continue adding value for those customers whose needs are met, dedicate time to fixing pain just as you do to adding features.\u003c/p\u003e\n\u003cdiv\u003e\u003ca title=\"Permanent link for Treat Customer Pain Like Debt\" href='https://audaciousfox.net/2019/pain-snowball-method'\u003e\u0026nbsp;\u0026#9650;\u0026#65038;\u0026nbsp;\u003c/a\u003e\u003c/div\u003e\n"
            }
        
        , 
            {
              
                "title": "▲ Pyramid of Product Team Needs",
                 
          "url": "https://audaciousfox.net/2019/product-team-needs/",
                "date_published": "2019-12-14T12:57:42-05:00",
                "id": "https://audaciousfox.net/2019/product-team-needs/",
                "author": {
                  "name" : "K.Q. Dreger"
                },
                "content_html": "\n\n\u003cp\u003eI was on a run and thinking about Maslow\u0026rsquo;s hierarchy of needs and how a force ranked list of needs could apply to product teams. Here\u0026rsquo;s my attempt. Let’s walk through the levels:\u003c/p\u003e\n\n\u003cp\u003e\u003ca href=\"/assets/images/pyramid.jpg\"\u003e\u003cimg src=\"https://dreger.me/assets/images/pyramid.jpg\" alt=\"pyramid of needs\" /\u003e\u003c/a\u003e\u003c/p\u003e\n\n\u003ch2 id=\"level-one-talk-with-your-customers-daily\"\u003eLevel one: talk with your customers daily.\u003c/h2\u003e\n\n\u003cp\u003eYou simply won’t have enough information to make good product decisions if you\u0026rsquo;re not talking with your customers every day. Call them. Email them. Ask them what they like, what they don\u0026rsquo;t like, what they wish your product could do, where they\u0026rsquo;re indifferent. Would they recommend your product to someone else? Who? Why not?\u003c/p\u003e\n\n\u003ch2 id=\"level-two-build-and-share-prototypes\"\u003eLevel two: build and share prototypes.\u003c/h2\u003e\n\n\u003cp\u003eYou have customer feedback, and now it’s time to create solutions for their problems. A good product team should be able to quickly prototype (code, Figma, whatever) ideas that are Just Enough™ to demonstrate the value and begin to unearth usability issues. Prototypes should be lightweight and shareable with a single link.\u003c/p\u003e\n\n\u003ch2 id=\"level-three-implement-lightweight-metrics\"\u003eLevel three: implement lightweight metrics.\u003c/h2\u003e\n\n\u003cp\u003eYou’ve built some stuff and now it’s time to measure whether it worked. The metrics rabbit hole is rife with products and terms and general misdirection about what you truly need. Do a lot of reading, ignore most of it. A maturing product team does need some form of analytics and metrics to shore up what you’re hearing from customers—but you do not need to spend tens of thousands of dollars and two months integrating with one of the huge product analytics players right out of the gate. Not yet.\u003c/p\u003e\n\n\u003cp\u003eAt this level, you only need to answer two questions: (a) what do we track to tell if our stuff is working and (b) how will we report on this data. For (a), basic things like page views, clicks, and lower level database fields can help indicate behavior (Have they turned on feature X? Set a date field with the date they turn it on.) For (b), you’ll either need to have direct access to the database and some SQL knowledge (it’s not hard to get the basics) or a web-based tool that simplifies the reporting for you. There are a lot of tools out there, just be extremely judicious about giving database access to a third party.\u003c/p\u003e\n\n\u003ch2 id=\"level-four-have-a-process-for-team-self-improvement\"\u003eLevel four: have a process for team self-improvement.\u003c/h2\u003e\n\n\u003cp\u003eDing. Welcome to level four. Enlightenment time. At this point, you should be completing enough create → ship → research cycles that recurring issues become apparent—especially if you’re looking at multiple product teams. Once you’ve identified these problem areas, you need to set aside time for growth and reflection. If you don’t, these small pains will become chronic injuries.\u003c/p\u003e\n\n\u003cp\u003eCompanies that get stuck at this stage will hemorrhage good people. This is because good product people are used to improving through iteration, and they won’t hang around a company that doesn’t treat the team as its most important product. (Side note: your company is your most important product.) Self-improvement at this level can be as simple as design reviews, a book club, or team retrospectives. Just set aside time and do it.\u003c/p\u003e\n\n\u003ch2 id=\"level-five-refine-delivery-release-and-marketing-ops\"\u003eLevel five: refine delivery, release, and marketing ops.\u003c/h2\u003e\n\n\u003cp\u003eThis is the last one I could think of, and it’s all about making sure the people you’ve got doing the things on the bottom four levels are able to spend as much time there as possible. However, once you reach a certain size I think having a team or members of the team assisting in the delivery, release, and marketing of the things you ship can be a big time saver.\u003c/p\u003e\n\n\u003cp\u003eRegardless what you call it (product ops, project manager, etc.), it’s the acknowledgment that if you want product people talking to customers, creating prototypes, and looking at the data, then anything they do that aren’t those things is hurting the lower levels of the pyramid.\u003c/p\u003e\n\n\u003ch2 id=\"what-s-not-here\"\u003eWhat\u0026rsquo;s not here?\u003c/h2\u003e\n\n\u003cp\u003eA lot. I’m certain this isn’t one-size fits all. But in general, I think if you pour time into one of these levels without an equal or greater amount of effort going into the level below it, you\u0026rsquo;re setting yourself up for problems later on.\u003c/p\u003e\n\u003cdiv\u003e\u003ca title=\"Permanent link for Pyramid of Product Team Needs\" href='https://audaciousfox.net/2019/product-team-needs'\u003e\u0026nbsp;\u0026#9650;\u0026#65038;\u0026nbsp;\u003c/a\u003e\u003c/div\u003e\n"
            }
        
        , 
            {
              
                "title": "▲ Don’t Hide the Date",
                 
          "url": "https://audaciousfox.net/2019/dont-hide-the-date/",
                "date_published": "2019-12-14T08:30:46-05:00",
                "id": "https://audaciousfox.net/2019/dont-hide-the-date/",
                "author": {
                  "name" : "K.Q. Dreger"
                },
                "content_html": "\u003cp\u003eI\u0026rsquo;ve noticed an interesting (growing?) trend over the past few years. Some bloggers (or their designers) choose to hide \u003cem\u003ewhen\u003c/em\u003e a post was written. I usually see this via dates excluded from the URL and/or the page itself. Why they\u0026rsquo;re doing this, I\u0026rsquo;m not sure.\u003c/p\u003e\n\n\u003cp\u003eFor URLs, I think dates are useful. Take this URL for example:\u003c/p\u003e\n\n\u003cp\u003e/2019/dont-hide-the-date\u003c/p\u003e\n\n\u003cp\u003eJust looking at it, you have a sense of when it was written and what it might be about. Instantly. That\u0026rsquo;s a good user experience.\u003c/p\u003e\n\n\u003cp\u003e(My favorite URL approach is from sites like Medium, where they opt for the questionable /title-GI83R1SH article ID at the end of their post URLs which manages to thread the needle of being both impossible to guess and devoid of any date context. I call this URL style post-modern, because what starts out understandable quickly turns convoluted.)\u003c/p\u003e\n\n\u003cp\u003eBut I understand not wanting extra cruft in your URLs. Having a clean website.com/post-title structure is attractive to my inner minimalist. Going title-only also makes it easier to recall the URL of a once-visited post, since you\u0026rsquo;re more likely to guess the title of an article than the title and date.\u003c/p\u003e\n\n\u003cp\u003eThen there\u0026rsquo;s the date on the page itself. I generally see a lot of designs use the smallest type size or the faintest gray color possible—if they even include the date at all. I think that\u0026rsquo;s the wrong way to go. Whether the post is timely or timeless, dates provide a sense of place and serve as an important piece of context for your readers.\u003c/p\u003e\n\n\u003cp\u003eYou don\u0026rsquo;t have to overemphasize the \u003cem\u003ewhen\u003c/em\u003e something was written, but please don\u0026rsquo;t leave it out completely.\u003c/p\u003e\n\u003cdiv\u003e\u003ca title=\"Permanent link for Don’t Hide the Date\" href='https://audaciousfox.net/2019/dont-hide-the-date'\u003e\u0026nbsp;\u0026#9650;\u0026#65038;\u0026nbsp;\u003c/a\u003e\u003c/div\u003e\n"
            }
        
        , 
            {
               
                "title": "NetNewsWire 5.0 Released",
                "external_url": "https://inessential.com/2019/08/26/netnewswire_5_0_now_available",
                 
          "url": "https://audaciousfox.net/linked/2019/netnewswire-5/",
                "date_published": "2019-09-02T12:58:18-04:00",
                "id": "https://audaciousfox.net/linked/2019/netnewswire-5/",
                "author": {
                  "name" : "K.Q. Dreger"
                },
                "content_html": "\u003cp\u003eIf I could only teach my non-technical friends two things about technology, I would encourage them to (a) learn the keyboard shortcuts for their most-used apps and (b) use RSS to read the news.\u003c/p\u003e\n\n\u003cp\u003eSpeaking of RSS, Brent Simmons has finally finished rewriting NetNewsWire—the storied RSS reader for the Mac. You can pick it up for free, and even if you\u0026rsquo;re not sure what RSS is, check out the link because, again, it\u0026rsquo;s one of only two things I wish more people knew about.\u003c/p\u003e\n\n\u003cp\u003eNetNewsWire only supports syncing via Feedbin at the moment (Feedly support is being considered), but you can also use it as a standalone RSS reader—no account required. That\u0026rsquo;s what I\u0026rsquo;m doing, and it works great. An iOS app is forthcoming, which I\u0026rsquo;m  excited about because for as terrible as desktop web news reading is, it\u0026rsquo;s 10x worse on mobile.\u003c/p\u003e\n\n\u003cp\u003eI like to measure products against the yardstick of what they set out to do. For me, NetNewsWire scores high on all marks. It\u0026rsquo;s fast, stable, and ultimately provides a small counterargument to the notion that we \u003cem\u003ehave\u003c/em\u003e to put up with website bloat, ad trackers, and algorithmically-powered social nonsense just to read the news.\u003c/p\u003e\n\u003cdiv\u003e\u003ca title=\"Permanent link for NetNewsWire 5.0 Released\" href='https://audaciousfox.net/linked/2019/netnewswire-5'\u003e\u0026nbsp;\u0026#9650;\u0026#65038;\u0026nbsp;\u003c/a\u003e\u003c/div\u003e\n"
            }
        
        , 
            {
               
                "title": "Replying to Emails Like a CEO Takes the Pain out of Writing Email",
                "external_url": "https://www.buzzfeednews.com/article/katienotopoulos/i-tried-emailing-like-your-boss",
                 
          "url": "https://audaciousfox.net/linked/2019/email-like-a-ceo/",
                "date_published": "2019-08-31T21:14:06-04:00",
                "id": "https://audaciousfox.net/linked/2019/email-like-a-ceo/",
                "author": {
                  "name" : "K.Q. Dreger"
                },
                "content_html": "\u003cp\u003eKatie Notopoulos, \u003cem\u003eBuzzfeed\u003c/em\u003e:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003eLet’s call this “boss email.” It’s defined by nearly immediate — but short and terse — replies. The classic two-word email.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eI used to have a \u0026ldquo;Sent from my iPhone\u0026rdquo; signature, regardless of whether I was on my phone or laptop. Helped to keep things terse.\u003c/p\u003e\n\u003cdiv\u003e\u003ca title=\"Permanent link for Replying to Emails Like a CEO Takes the Pain out of Writing Email\" href='https://audaciousfox.net/linked/2019/email-like-a-ceo'\u003e\u0026nbsp;\u0026#9650;\u0026#65038;\u0026nbsp;\u003c/a\u003e\u003c/div\u003e\n"
            }
        
        , 
            {
               
                "title": "Genius Claims to Have Proof That Google Is Lifting Lyrics for Its Search Results",
                "external_url": "https://www.wsj.com/articles/lyrics-site-genius-com-accuses-google-of-lifting-its-content-11560677400",
                 
          "url": "https://audaciousfox.net/linked/2019/genius-google-lyrics/",
                "date_published": "2019-06-17T21:33:15-04:00",
                "id": "https://audaciousfox.net/linked/2019/genius-google-lyrics/",
                "author": {
                  "name" : "K.Q. Dreger"
                },
                "content_html": "\u003cp\u003eRobert McMillan, \u003cem\u003eThe Wall Street Journal\u003c/em\u003e:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003e“Over the last two years, we’ve shown Google irrefutable evidence again and again that they are displaying lyrics copied from Genius,” said Ben Gross, Genius’s chief strategy officer, in an email message. The company said it used a watermarking system in its lyrics that embedded patterns in the formatting of apostrophes. Genius said it found more than 100 examples of songs on Google that came from its site.\u003c/p\u003e\n\n\u003cp\u003eStarting around 2016, Genius said, the company made a subtle change to some of the songs on its website, alternating the lyrics’ apostrophes between straight and curly single-quote marks in exactly the same sequence for every song.\u003c/p\u003e\n\n\u003cp\u003eWhen the two types of apostrophes were converted to the dots and dashes used in Morse code, they spelled out the words “Red Handed.”\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eHiding fake or secret data inside of protected works is relatively common practice. In cartography, map makers will include fake roads known as \u003ca href=\"https://en.wikipedia.org/wiki/Trap_street\"\u003etrap streets\u003c/a\u003e, and laser printers have long \u003ca href=\"https://en.wikipedia.org/wiki/Machine_Identification_Code\"\u003eincluded tracking dots\u003c/a\u003e that let you trace any printed page back to the printer that created it. Wikipedia has a whole list of these \u003ca href=\"https://en.wikipedia.org/wiki/Fictitious_entry\"\u003efictitious entries\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003eGenius\u0026rsquo; approach takes the cake for me though, because it involves punctuation and typography.\u003c/p\u003e\n\n\u003cp\u003eThere are better people to explain the nuances and mess of Genius\u0026rsquo; attempted enforcement of pseudo copyright over lyrics that don\u0026rsquo;t belong to them. (As \u003ca href=\"https://pxlnv.com/linklog/genius-google-lyrics-ripoff/\"\u003eNick Heer says\u003c/a\u003e, Genius\u0026rsquo; content is a mix of \u0026ldquo;best guess original transcription[s]\u0026rdquo; and artist-verified lyrics.) But ultimately, this points back to Google\u0026rsquo;s enormous control over the traffic, and often financial wellbeing, of sites whose content it decides to scrape and surface via Knowledge Panels or Featured Snippets.\u003c/p\u003e\n\u003cdiv\u003e\u003ca title=\"Permanent link for Genius Claims to Have Proof That Google Is Lifting Lyrics for Its Search Results\" href='https://audaciousfox.net/linked/2019/genius-google-lyrics'\u003e\u0026nbsp;\u0026#9650;\u0026#65038;\u0026nbsp;\u003c/a\u003e\u003c/div\u003e\n"
            }
        
        , 
            {
               
                "title": "‘What I Learned Trying To Secure Congressional Campaigns’",
                "external_url": "https://idlewords.com/2019/05/what_i_learned_trying_to_secure_congressional_campaigns.htm",
                 
          "url": "https://audaciousfox.net/linked/2019/ceglowski-securing-congressional-campaigns/",
                "date_published": "2019-06-05T22:43:27-04:00",
                "id": "https://audaciousfox.net/linked/2019/ceglowski-securing-congressional-campaigns/",
                "author": {
                  "name" : "K.Q. Dreger"
                },
                "content_html": "\u003cp\u003eMaciej Cegłowski:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003ePractical campaign security is a wood chipper for your hopes and dreams. It sits at the intersection of 19 kinds of status quo, each more odious than the last. You have to accept the fact that computers are broken, software is terrible, campaign finance is evil, the political parties are inept, the DCCC exists, politics is full of parasites, tech companies are run by arrogant man-children, and so on.\u003c/p\u003e\n\n\u003cp\u003ePutting aside the urge to fix these broken systems long enough to help people get work done is the great unsolved problem of campaign security. You will start out a descriptivist and end up a zealot, like I did. Trying to secure a modern campaign is like doing surgery with a scalpel made out of anthrax spores. At some point you will throw down the anthrax scalpel and say \u0026ldquo;this is impossible!\u0026rdquo;, as it disappears in a puff of lethal dust. But the patient still needs you!\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eNoble effort. Outstanding writing.\u003c/p\u003e\n\n\u003cp\u003eGetting regular people—let alone regular people who are \u003cem\u003ealso\u003c/em\u003e working for a political campaign—to spend any extra time on securing their digital accounts is a daunting task, but it makes for a deeply interesting story.\u003c/p\u003e\n\n\u003cp\u003eI think my main takeaway, security-related at least, was how malicious attachments are still a primary vector of attack. An email containing a spreadsheet titled \u0026ldquo;donor-list.xls\u0026rdquo; will almost certainly be opened. And for folks not using a device that makes dubious \u003ccode\u003e.xls\u003c/code\u003e files benign (like a Chromebook or something running iOS), then it doesn\u0026rsquo;t matter how strong your email password is—game\u0026rsquo;s over.\u003c/p\u003e\n\u003cdiv\u003e\u003ca title=\"Permanent link for ‘What I Learned Trying To Secure Congressional Campaigns’\" href='https://audaciousfox.net/linked/2019/ceglowski-securing-congressional-campaigns'\u003e\u0026nbsp;\u0026#9650;\u0026#65038;\u0026nbsp;\u003c/a\u003e\u003c/div\u003e\n"
            }
        
        , 
            {
               
                "title": "Updated App Store Review Guidelines Prohibit Apps in Kids Category From Including Third-Party Ads or Analytics",
                "external_url": "https://developer.apple.com/news/?id=06032019j",
                 
          "url": "https://audaciousfox.net/linked/2019/updated-app-store-guidelines-to-protect-kids/",
                "date_published": "2019-06-04T21:25:43-04:00",
                "id": "https://audaciousfox.net/linked/2019/updated-app-store-guidelines-to-protect-kids/",
                "author": {
                  "name" : "K.Q. Dreger"
                },
                "content_html": "\u003cp\u003eApple Developer newsroom:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003eIn order to help keep kids’ data private, apps in the kids category and apps intended for kids cannot include third-party advertising or analytics software and may not transmit data to third parties. This guideline is now enforced for new apps. Existing apps must follow this guideline by September 3, 2019.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eApple is not messing around on privacy—and not just in their own apps anymore.\u003c/p\u003e\n\n\u003cp\u003eIt\u0026rsquo;s taken a few years of sustained messaging and actions, but Apple\u0026rsquo;s approach to privacy now sits equal with their dedication to design in terms of why I continue to buy their products.\u003c/p\u003e\n\u003cdiv\u003e\u003ca title=\"Permanent link for Updated App Store Review Guidelines Prohibit Apps in Kids Category From Including Third-Party Ads or Analytics\" href='https://audaciousfox.net/linked/2019/updated-app-store-guidelines-to-protect-kids'\u003e\u0026nbsp;\u0026#9650;\u0026#65038;\u0026nbsp;\u003c/a\u003e\u003c/div\u003e\n"
            }
        
        , 
            {
               
                "title": "Panic Announces Playdate, Their First Video Game System Set to Launch in 2020 for $149 With 12 Games That Automatically Release on a Weekly Basis",
                "external_url": "https://play.date/media/",
                 
          "url": "https://audaciousfox.net/linked/2019/panic-announces-playdate/",
                "date_published": "2019-05-23T21:06:48-04:00",
                "id": "https://audaciousfox.net/linked/2019/panic-announces-playdate/",
                "author": {
                  "name" : "K.Q. Dreger"
                },
                "content_html": "\u003cp\u003eFrom Panic\u0026rsquo;s \u003ca href=\"https://play.date/media/\"\u003epress release\u003c/a\u003e:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003eToday, after more than four years of work by a small and talented team, Panic is extremely excited to introduce Playdate, a brand new handheld gaming system.\u003c/p\u003e\n\n\u003cp\u003ePlaydate is both very familiar, and totally new. It’s yellow, and fits perfectly in a pocket. It has a black-and-white screen with high reflectivity, a crystal-clear image, and no backlight. And of course, it has Wi-Fi, Bluetooth, USB-C, and a headphone jack. But it also has a crank. Yes, a crank: a cute, rotating analog controller that flips out from the side. It’s literally revolutionary.\u003c/p\u003e\n\n\u003cp\u003eThere’s more: Playdate includes games — a full season of them. The games will be delivered over-the-air, once a week for 12 weeks, and they’ll be a surprise: when the new game light flashes, you’ll never know what you’re about to play. Panic recruited some of the world’s best game designers — some well known; others under the radar — to make games exclusively for our system. Playdate isn’t just hardware: it’s a complete experience.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003e\u003ca href=\"https://kotaku.com/the-people-who-published-firewatch-are-now-making-a-gam-1834958316\"\u003eMike Fahey\u003c/a\u003e, \u003cem\u003eKotaku\u003c/em\u003e:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003eWhen I received the Playdate announcement under embargo last week, I thought it was a joke. \u003ca href=\"https://panic.com/\"\u003ePanic\u003c/a\u003e is a company that makes web utility apps for smartphones and published adventure game Firewatch with Campo Santo. Now it’s jumping directly into game hardware with this strange little yellow box. It is a nice-looking box.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eJohn Gruber, \u003cem\u003eDaring Fireball\u003c/em\u003e:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003ePanic is almost cheating in a way because they’re tiny. The Playdate platform isn’t competing with the state of the art. It’s not a retro platform, per se, but while it has an obviously nostalgic charm it is competing only on its own terms. Its only goal is to be fun. And aspects of Playdate are utterly modern: Wi-Fi, Bluetooth, apps and software updates delivered over-the-air.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003e\u003ca href=\"https://techcrunch.com/2019/05/22/panics-playmate-is-a-pint-sized-gaming-machine-with-a-season-of-12-intriguing-titles/\"\u003eDevin Coldewey\u003c/a\u003e, \u003cem\u003eTechCrunch\u003c/em\u003e:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003eIt’s different, all right. Bright yellow with a black and white screen and with no spot for removable media like cartridges, the Playdate is more or less self-contained, except of course for the charger and wireless connection. And it’s over the wireless connection that the games come: 12 of them, exclusives created by well-known developers like Keita Takahashi (Katamari Damacy), Bennett Foddy (Getting Over It) and Zach Gage (Ridiculous Fishing).\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003e\u003ca href=\"https://www.macstories.net/news/panic-reveals-plans-to-sell-a-handheld-gaming-system-called-the-playdate-in-2020/\"\u003eJohn Voorhees\u003c/a\u003e, \u003cem\u003eMacStories\u003c/em\u003e:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003ePlaydate\u0026rsquo;s hardware is not like anything currently available on the market, and Panic says the device isn\u0026rsquo;t meant to compete with other handheld systems either. Instead, the goal is to complement existing systems for those times in between using other devices when you want to play a game.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eI \u003ca href=\"https://audaciousfox.net/2016/firewatch/\"\u003ewas a fan\u003c/a\u003e of Panic\u0026rsquo;s last foray into video games with \u003cem\u003eFirewatch\u003c/em\u003e, and I\u0026rsquo;ve been following along with their near-release \u003ca href=\"https://www.macstories.net/news/panic-to-publish-untitled-goose-game-by-house-house-in-early-2019-on-switch-mac-and-pc/\"\u003e\u003cem\u003eUntitled Goose Game\u003c/em\u003e\u003c/a\u003e, but\u0026hellip; actual hardware? Hardware that looks simultaneously cute, innovative, and fun? How interesting. I mean, just \u003ca href=\"/images/playdate-model-shot.jpg\"\u003elook at it\u003c/a\u003e:\u003c/p\u003e\n\n\u003cp\u003e\u003cimg src=\"/images/playdate-model-shot.jpg\" alt=\"playdate product image\" /\u003e\u003c/p\u003e\n\n\u003cp\u003ePlaydate is launching in 2020 for $149, and includes a \u0026ldquo;season\u0026rdquo; of 12 \u003cem\u003edifferent\u003c/em\u003e games, with each title being released one week at a time. As a device meant to complement existing gaming systems, Playdate is intriguing; as a delivery service for new games from \u003cem\u003eseparate\u003c/em\u003e developers, it\u0026rsquo;s innovative.\u003c/p\u003e\n\n\u003cp\u003eIf I\u0026rsquo;m skeptical at all, it\u0026rsquo;s because ultimately the games themselves need to be fun. I love thoughtful, well designed hardware, but if the games aren\u0026rsquo;t compelling then Playdate is destined to be a memorable niche product sitting on the shelves of enthusiasts that buy them. At $149 a pop, this won\u0026rsquo;t be something regular people buy on a whim, even if they\u0026rsquo;re gaming fans.\u003c/p\u003e\n\n\u003cp\u003eIf you\u0026rsquo;re at all interested in Playdate itself (or just \u003cem\u003ereally\u003c/em\u003e good web design), go check out \u003ca href=\"https://play.date\"\u003eplay.date\u003c/a\u003e and sign up to be notified when the units go on sale.\u003c/p\u003e\n\u003cdiv\u003e\u003ca title=\"Permanent link for Panic Announces Playdate, Their First Video Game System Set to Launch in 2020 for $149 With 12 Games That Automatically Release on a Weekly Basis\" href='https://audaciousfox.net/linked/2019/panic-announces-playdate'\u003e\u0026nbsp;\u0026#9650;\u0026#65038;\u0026nbsp;\u003c/a\u003e\u003c/div\u003e\n"
            }
        
        , 
            {
               
                "title": "You’re Triggering Alexa More Often Than You Think",
                "external_url": "https://www.washingtonpost.com/technology/2019/05/06/alexa-has-been-eavesdropping-you-this-whole-time/",
                 
          "url": "https://audaciousfox.net/linked/2019/triggering-alexa-on-accident/",
                "date_published": "2019-05-20T21:00:15-04:00",
                "id": "https://audaciousfox.net/linked/2019/triggering-alexa-on-accident/",
                "author": {
                  "name" : "K.Q. Dreger"
                },
                "content_html": "\u003cp\u003eGeoffrey A. Fowler, \u003cem\u003eWashington Post\u003c/em\u003e:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003eI listened to four years of my Alexa archive and found thousands of fragments of my life: spaghetti-timer requests, joking houseguests and random snippets of “Downton Abbey.” There were even sensitive conversations that somehow triggered Alexa’s “wake word” to start recording, including my family discussing medication and a friend conducting a business deal. [\u0026hellip;]\u003c/p\u003e\n\n\u003cp\u003eWhat can you do to stop Alexa from recording? Amazon’s answer is \u003ca href=\"https://www.washingtonpost.com/news/the-switch/wp/2018/04/12/no-mark-zuckerberg-were-not-really-in-control-of-our-data/\"\u003estraight out of the Facebook playbook\u003c/a\u003e: “Customers have control,” it says — but the product’s design clearly isn’t meeting our needs. You can manually delete past recordings if you know exactly \u003ca href=\"http://amazon.com/alexaprivacy\"\u003ewhere to look\u003c/a\u003e and remember to keep going back. You cannot stop Amazon from making these recordings, aside from muting the Echo’s microphone (defeating its main purpose) or unplugging the darned thing.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eWe\u0026rsquo;ve been using an Echo Dot for the past two weeks, and in reviewing my own past recordings I found one snippet that was just of my son crying. (Crying I assume over what we had given him for lunch.) Based on how many times we\u0026rsquo;ve initiated Alexa so far, our unintentional activation rate is around 2.5%. That\u0026rsquo;s\u0026hellip; bad? I\u0026rsquo;m not sure.\u003c/p\u003e\n\n\u003cp\u003ePart of this is the compromise of even bringing these devices into our homes—we trade manually setting kitchen timers and looking up measurement conversions for the convenience of an always-present assistant that also happens to be a recording device connected to the Internet.\u003c/p\u003e\n\n\u003cp\u003eStill, I\u0026rsquo;d feel better if Amazon had \u003cem\u003eless\u003c/em\u003e information about me and I was \u003cem\u003emore\u003c/em\u003e aware of when Alexa was listening. Thankfully both of these things are possible. The first is accomplished by deleting \u003ca href=\"http://amazon.com/alexaprivacy\"\u003eyour own Alexa recordings\u003c/a\u003e, and the second can be done by enabling the Echo\u0026rsquo;s \u0026ldquo;Start of Request\u0026rdquo; sound, found under the Settings. I\u0026rsquo;m still not sold on the Echo Dot as a permanent fixture of our counter space, and unintentional activations are definitely something I\u0026rsquo;ll be keeping an eye on for the next few weeks.\u003c/p\u003e\n\u003cdiv\u003e\u003ca title=\"Permanent link for You’re Triggering Alexa More Often Than You Think\" href='https://audaciousfox.net/linked/2019/triggering-alexa-on-accident'\u003e\u0026nbsp;\u0026#9650;\u0026#65038;\u0026nbsp;\u003c/a\u003e\u003c/div\u003e\n"
            }
        
        , 
            {
               
                "title": "Jumbo Is Your Digital Privacy Assistant",
                "external_url": "https://blog.jumboprivacy.com/jumbo-launches-today.html",
                 
          "url": "https://audaciousfox.net/linked/2019/jumbo-privacy-assistant/",
                "date_published": "2019-05-19T13:54:51-04:00",
                "id": "https://audaciousfox.net/linked/2019/jumbo-privacy-assistant/",
                "author": {
                  "name" : "K.Q. Dreger"
                },
                "content_html": "\u003cp\u003ePierre Valade (previously CEO of Sunrise Calendar, which was acquired by Microsoft) has launched  \u003ca href=\"https://itunes.apple.com/us/app/jumbo-privacy/id1454039975\"\u003eJumbo\u003c/a\u003e, a \u0026ldquo;privacy assistant\u0026rdquo; for iOS. Curious, I thought, because most other digital assistants are hellbent on collecting as much information about me as possible. In reality, Jumbo is less of an assistant and more of a user-friendly way for you to delete old tweets, Alexa voice recordings, and Google searches. One tap and everything gets erased. If you\u0026rsquo;ve ever tried to delete this sort of data by hand (data that Twitter, Amazon, and Google would rather you let them keep) you\u0026rsquo;ll know how wonderfully simple Jumbo\u0026rsquo;s approach is.\u003c/p\u003e\n\n\u003cp\u003eMy favorite thing about Jumbo is that \u003ca href=\"https://blog.jumboprivacy.com/secure-jumbo-never-sees-your-data.html\"\u003eeverything\u0026rsquo;s handled locally\u003c/a\u003e—none of my data gets stored or manipulated server-side. The compromise is that since Jumbo doesn\u0026rsquo;t store any of my logins or information on their servers, it\u0026rsquo;s on me to open the app every week and initiate a cleaning. A small price to pay.\u003c/p\u003e\n\n\u003cp\u003eJumbo is the rare example of a truly user-focused privacy product. None of your information is slipped out the side door to sell ads, and Mr. Valade is upfront with how they plan to make money: premium features, accessible via subscription. I\u0026rsquo;m not optimistic that Jumbo will be around for the longterm—how many people will pay for something like this?—but for now consider me a fan.\u003c/p\u003e\n\u003cdiv\u003e\u003ca title=\"Permanent link for Jumbo Is Your Digital Privacy Assistant\" href='https://audaciousfox.net/linked/2019/jumbo-privacy-assistant'\u003e\u0026nbsp;\u0026#9650;\u0026#65038;\u0026nbsp;\u003c/a\u003e\u003c/div\u003e\n"
            }
        
        , 
            {
               
                "title": "‘Typography 2020: A Special Listicle for America’",
                "external_url": "https://practicaltypography.com/typography-2020.html",
                 
          "url": "https://audaciousfox.net/linked/2019/butterick-typography-2020/",
                "date_published": "2019-04-19T15:00:40-04:00",
                "id": "https://audaciousfox.net/linked/2019/butterick-typography-2020/",
                "author": {
                  "name" : "K.Q. Dreger"
                },
                "content_html": "\u003cp\u003eTypographer, writer, and lawyer Matthew Butterick:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003eFor those who think it trivializes our political process to judge candidates by their typography—what would you prefer we scrutinize? Qualifications? Ground into dust during the last election. Issues? Be my guest. Whether a candidate will ever fulfill a certain campaign promise about a certain issue is conjectural.\u003c/p\u003e\n\n\u003cp\u003eBut typography—that’s a real decision candidates have to make today, with real money and real consequences. And if I can’t trust you to pick some reasonable fonts and colors, then why should I trust you with the nuclear codes?\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eWebsite design, color selections, type kerning—Mr. Butterick hits them all. But my favorite bit is his \u0026ldquo;a slice of bacon using a playground slide in an unsafe way\u0026rdquo; description of Andrew Yang\u0026rsquo;s logo. 100% spot on.\u003c/p\u003e\n\u003cdiv\u003e\u003ca title=\"Permanent link for ‘Typography 2020: A Special Listicle for America’\" href='https://audaciousfox.net/linked/2019/butterick-typography-2020'\u003e\u0026nbsp;\u0026#9650;\u0026#65038;\u0026nbsp;\u003c/a\u003e\u003c/div\u003e\n"
            }
        
        , 
            {
               
                "title": "The 3D Models That Will Help Rebuild Notre-Dame",
                "external_url": "https://www.gpsworld.com/3d-mapping-of-notre-dame-will-help-restoration/",
                 
          "url": "https://audaciousfox.net/linked/2019/notre-dame-assassins-creed/",
                "date_published": "2019-04-19T12:59:14-04:00",
                "id": "https://audaciousfox.net/linked/2019/notre-dame-assassins-creed/",
                "author": {
                  "name" : "K.Q. Dreger"
                },
                "content_html": "\u003cp\u003eBetween art historian Andrew Tallon\u0026rsquo;s \u003ca href=\"https://news.nationalgeographic.com/2015/06/150622-andrew-tallon-notre-dame-cathedral-laser-scan-art-history-medieval-gothic/\"\u003elaser scanning of the entire cathedral\u003c/a\u003e in 2015 and the \u003ca href=\"https://www.theverge.com/2014/10/31/7132587/assassins-creed-unity-paris\"\u003eincredibly detailed models\u003c/a\u003e created for Ubisoft\u0026rsquo;s mega-franchise \u003cem\u003eAssassin\u0026rsquo;s Creed: Unity\u003c/em\u003e, the French people have not only centimeter-level measurements, but also an entire interactive, atmospheric representation of Notre-Dame to reference as they rebuild.\u003c/p\u003e\n\n\u003chr /\u003e\n\n\u003cp\u003eI had the luck to visit Notre-Dame several years ago, and it was simply awe inspiring. To see it in flames last week evoked what can only be described as a deep sense of mourning.\u003c/p\u003e\n\u003cdiv\u003e\u003ca title=\"Permanent link for The 3D Models That Will Help Rebuild Notre-Dame\" href='https://audaciousfox.net/linked/2019/notre-dame-assassins-creed'\u003e\u0026nbsp;\u0026#9650;\u0026#65038;\u0026nbsp;\u003c/a\u003e\u003c/div\u003e\n"
            }
        
        , 
            {
               
                "title": "Medium, Seven Years Later",
                "external_url": "https://practicaltypography.com/billionaires-typewriter.html#update-another-three-years-on",
                 
          "url": "https://audaciousfox.net/linked/2019/butterick-on-mediums-history/",
                "date_published": "2019-04-13T12:09:19-04:00",
                "id": "https://audaciousfox.net/linked/2019/butterick-on-mediums-history/",
                "author": {
                  "name" : "K.Q. Dreger"
                },
                "content_html": "\u003cp\u003eMatthew Butterick, with some additional analysis on Laura Owen\u0026rsquo;s \u003ca href=\"https://audaciousfox.net/linked/2019/the-frustrating-history-of-medium/\"\u003edeep dive into Medium\u0026rsquo;s history\u003c/a\u003e:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003eWhat stands out the most? Though Medium’s value to online publishing has remained abstract, the harm it has inflicted—especially upon the authors and publications who have been lured onto the platform (by one pivot) and then stranded (by the next)—is concrete. As writer Jaya Saxena \u003ca href=\"https://twitter.com/jayasax/status/994252016129101824\"\u003eput it\u003c/a\u003e, “every writer/cartoonist I know has had their life ruined by Medium at some point”. [\u0026hellip;]\u003c/p\u003e\n\n\u003cp\u003eWhich brings us to the $132 million question: who\u0026rsquo;s going to pay $50 every year for this? People dissatisfied with the unlimited free clickbait available elsewhere? Gulls, rubes, and saps? Dogs with credit cards? Mr. Williams has always preferred to frame Medium in gauzy platitudes\u0026mdash;what I called his \u0026ldquo;Bellagio buffet of delicious nonsense\u0026rdquo;. Once upon a time, this seemed like the benign puffery of the ultrawealthy. Billionaire-splaining. Today, as the gulf between the promise of Medium and the reality yawns ever larger, it seems like abject denial. Again\u0026mdash;has Mr. Williams actually spent time on Medium recently? If so, it hasn\u0026rsquo;t made a dent. If not, I can hardly blame him. It\u0026rsquo;s awful.\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cdiv\u003e\u003ca title=\"Permanent link for Medium, Seven Years Later\" href='https://audaciousfox.net/linked/2019/butterick-on-mediums-history'\u003e\u0026nbsp;\u0026#9650;\u0026#65038;\u0026nbsp;\u003c/a\u003e\u003c/div\u003e\n"
            }
        
        , 
            {
               
                "title": "The Long, Complicated, and Extremely Frustrating History of Medium",
                "external_url": "https://www.niemanlab.org/2019/03/the-long-complicated-and-extremely-frustrating-history-of-medium-2012-present/",
                 
          "url": "https://audaciousfox.net/linked/2019/the-frustrating-history-of-medium/",
                "date_published": "2019-04-13T12:02:12-04:00",
                "id": "https://audaciousfox.net/linked/2019/the-frustrating-history-of-medium/",
                "author": {
                  "name" : "K.Q. Dreger"
                },
                "content_html": "\u003cp\u003eI\u0026rsquo;ve secretly been wishing for someone to create a complete compendium of Medium\u0026rsquo;s trials and tribulations because the task, had I taken it on myself, would have simply driven me into a deep, dark, depressing place from which I may not have emerged. Thankfully Laura Hazard Owen, writing for the Nieman Journalism Lab, was more than up to the task:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003eWhy spend so much time worrying about what Medium is? Maybe because we wanted to know whether it was a friend or an enemy. The answer is that it’s neither. It’s a reflection of what the media industry has worried about, and hoped for, and not received. But Medium was never something that we would get to define. Instead, it’s turned out to be an endless thought experiment into what publishing on the internet could look like. That’s not much fun for people who got burned along the way, but Medium was never exactly ours to begin with.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eMs. Owen\u0026rsquo;s resulting timeline is filled with bite-sized notable events from Medium\u0026rsquo;s history, starting \u003ca href=\"https://medium.com/@ev/welcome-to-medium-9e53ca408c48\"\u003ewith the August 2012 launch\u003c/a\u003e, in which Founder and CEO Ev Williams heralded the site as, “a beautiful space for reading and writing — and little else.”\u003c/p\u003e\n\n\u003cp\u003eThe following ~90 events, covering seven years, contain some fun trivia you might have forgotten. Like how the White House \u003ca href=\"https://www.washingtonpost.com/blogs/erik-wemple/wp/2015/01/21/medium-editor-on-sotu-coup-people-are-already-here/\"\u003equietly published the entirety of President Obama’s State of the Union remarks\u003c/a\u003e to Medium before the speech began. Or just how many notable publications jumped head-first into the platform, only \u003ca href=\"https://slate.com/technology/2018/01/a-slate-tribute-to-the-awl-and-the-hairpin.html\"\u003eto die later\u003c/a\u003e. Regardless, reading through the entire timeline will remind you that Medium\u0026rsquo;s current identity crisis isn\u0026rsquo;t so much a recent ailment as it is a chronic one.\u003c/p\u003e\n\u003cdiv\u003e\u003ca title=\"Permanent link for The Long, Complicated, and Extremely Frustrating History of Medium\" href='https://audaciousfox.net/linked/2019/the-frustrating-history-of-medium'\u003e\u0026nbsp;\u0026#9650;\u0026#65038;\u0026nbsp;\u003c/a\u003e\u003c/div\u003e\n"
            }
        
        , 
            {
               
                "title": "‘Letter Boxed’ by The New York Times",
                "external_url": "https://www.polygon.com/2019/2/1/18205854/new-york-times-crossword-letter-boxed-puzzle-game",
                 
          "url": "https://audaciousfox.net/linked/2019/nyt-letter-boxed/",
                "date_published": "2019-02-09T15:20:21-05:00",
                "id": "https://audaciousfox.net/linked/2019/nyt-letter-boxed/",
                "author": {
                  "name" : "K.Q. Dreger"
                },
                "content_html": "\u003cp\u003eSamit Sarkar, \u003cem\u003ePolygon\u003c/em\u003e, writing about the newest word game from the Times’ Games Expansion Team (which I didn\u0026rsquo;t know was a thing):\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003e\u003cem\u003eLetter Boxed\u003c/em\u003e takes place around, well, a box. There are three letters on each side, and players must connect them to make words at least three letters long. Letters on the same side cannot be used consecutively, and the final letter of each word becomes the first letter of the next word. The goal is to use all 12 letters in as few words as possible. “It’s a lot faster, it’s a much quicker hit, but you can kind of keep playing that too forever,” said [Times’s Games Expansion Team Lead] Von Ehren.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eI really like this game. Whereas crosswords are built from a preset list of words, a round \u003cem\u003eLetter Boxed\u003c/em\u003e is almost entirely freeform and relies on the vocabulary you know. My current strategy is to rotate between using long and short words, and it\u0026rsquo;s been working out OK this week.\u003c/p\u003e\n\n\u003cp\u003eThe only caveat to \u003cem\u003eLetter Boxed\u003c/em\u003e (right now, at least) is that you need a \u003cem\u003eTimes\u003c/em\u003e subscription to play. It\u0026rsquo;s not such a great game to justify a subscription if you don\u0026rsquo;t also read the paper, but it is a nice addition for current subscribers. And as \u003cem\u003eThe New York Times\u003c/em\u003e continues \u003ca href=\"https://www.nytimes.com/2019/02/06/business/media/new-york-times-earnings-digital-subscriptions.html\"\u003einvest in and reap the benefits of\u003c/a\u003e its digital offerings, I\u0026rsquo;m excited to see what the Games Expansion Team works on next.\u003c/p\u003e\n\u003cdiv\u003e\u003ca title=\"Permanent link for ‘Letter Boxed’ by The New York Times\" href='https://audaciousfox.net/linked/2019/nyt-letter-boxed'\u003e\u0026nbsp;\u0026#9650;\u0026#65038;\u0026nbsp;\u003c/a\u003e\u003c/div\u003e\n"
            }
        
        , 
            {
               
                "title": "‘Can a 44-Year-Old Man Cut It in the Premier League?’",
                "external_url": "http://www.espn.com/espn/feature/story/_/id/22705066/chris-jones-takes-medical-everton",
                 
          "url": "https://audaciousfox.net/linked/2019/espn-jones-everton/",
                "date_published": "2019-02-09T14:31:37-05:00",
                "id": "https://audaciousfox.net/linked/2019/espn-jones-everton/",
                "author": {
                  "name" : "K.Q. Dreger"
                },
                "content_html": "\u003cp\u003eChris Jones, \u003cem\u003eESPN\u003c/em\u003e, attempted to complete the medical and fitness review required of all Everton F.C. players. It did not go well.\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003eLet\u0026rsquo;s get this out of the way. I\u0026rsquo;m supposed to say that my greatest source of pride is my children, but they haven\u0026rsquo;t really done anything that special. They\u0026rsquo;re regular kids, and there are billions of those. My greatest source of pride is that I still play competitive football at age 44. There are players in my league as young as 18. I\u0026rsquo;ve privately hoped that one day I\u0026rsquo;ll play alongside my youngest son, who is 10. Eight more years. That makes 52.\u003c/p\u003e\n\n\u003cp\u003eLuckily, I\u0026rsquo;m a goalkeeper. Unluckily, I\u0026rsquo;m short and fat. I\u0026rsquo;m 5-foot-10 and 214 pounds. I worried that Everton wouldn\u0026rsquo;t have a kit that fit me, and I searched for a comparably sized player. In other words, I looked up Wayne Rooney. He\u0026rsquo;s a similar height but 30 pounds lighter. I warned Everton in advance that they would be outfitting Wayne Rooney\u0026hellip; if Wayne Rooney were pregnant with twins.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003e(Hat tip PDL.)\u003c/p\u003e\n\u003cdiv\u003e\u003ca title=\"Permanent link for ‘Can a 44-Year-Old Man Cut It in the Premier League?’\" href='https://audaciousfox.net/linked/2019/espn-jones-everton'\u003e\u0026nbsp;\u0026#9650;\u0026#65038;\u0026nbsp;\u003c/a\u003e\u003c/div\u003e\n"
            }
        
        , 
            {
               
                "title": "Proposed Changes to Chrome Would Hamper Ad Blockers",
                "external_url": "https://www.wired.com/story/googles-proposed-changes-chrome-could-weaken-ad-blockers/",
                 
          "url": "https://audaciousfox.net/linked/2019/chrome-ad-blockers/",
                "date_published": "2019-01-26T09:11:05-05:00",
                "id": "https://audaciousfox.net/linked/2019/chrome-ad-blockers/",
                "author": {
                  "name" : "K.Q. Dreger"
                },
                "content_html": "\u003cp\u003eKlint Finley, \u003cem\u003eWired\u003c/em\u003e:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003eGoogle says the proposal is just, well, a proposal. \u0026ldquo;These changes are in the design process,\u0026rdquo; a Google spokesperson said in a statement. The company is \u0026ldquo;working with extension developers to make sure their extensions continue to work,\u0026rdquo; the spokesperson said.\u003c/p\u003e\n\n\u003cp\u003eOstensibly, the changes are designed to improve the security and performance of Chrome and Chromium. For example, Chrome extensions now can access your browsing history. That means a bad actor could offer an ad blocker that spies on you.\u003c/p\u003e\n\n\u003cp\u003eGoogle is proposing to cut off extensions\u0026rsquo; access to browsing history and instead offer an interface that can generate instructions for the browser to block or modify certain content, including ads. The catch is that each extension would be limited to 30,000 rules it can apply.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eGoogle runs the largest digital ad platform in the United States, the  world\u0026rsquo;s most popular web browser, and the company \u003ca href=\"https://audaciousfox.net/2017/advertisement-farm/\"\u003emakes almost all of its money from advertisements\u003c/a\u003e. Google wants you to see more ads. Their business depends on it, in fact.\u003c/p\u003e\n\n\u003cp\u003eTherefore, any Google-led changes to Chrome that restrict a user\u0026rsquo;s ability to \u003cem\u003eblock ads\u003c/em\u003e will inevitably be under intense scrutiny—and for good reason. Taken in the best light, this is Google trying to ensure Chrome continues to be as fast and secure as possible. Taken in the worst, these proposed changes are one more instance of Google using its dominance in search, advertising, and web browsing to benefit Google.\u003c/p\u003e\n\n\u003cp\u003eThis move isn\u0026rsquo;t totally without precedence—Apple made a similar change in 2015 when it limited the number of rules a content blocker  could employ to 50,000. But a combination of Google\u0026rsquo;s proposal limiting the number of rules to just 30,000 and Google being, well, Google has escalated this story to a whole other level.\u003c/p\u003e\n\n\u003cp\u003eTo be fair though, even though Apple allows content blockers to use 50,000 rules, popular ad blockers (read: ones that do the job well) often need hundreds of thousands of rules to be effective. I \u003ca href=\"https://1blocker.com\"\u003euse 1Blocker\u003c/a\u003e on my devices,  but even 1Blocker\u0026rsquo;s developer skirts around the 50,000 rule limit by \u003ca href=\"https://twitter.com/1blockerapp/status/987214584376430592?lang=en\"\u003eimplementing each rule \u0026ldquo;set\u0026rdquo; as a separate content blocker\u003c/a\u003e, thereby allow 1Blocker to check against over 350,000 rules.\u003c/p\u003e\n\n\u003cp\u003eAt the end of the day, this change to Chrome is only a proposal. And if we\u0026rsquo;re giving Google any kudos, it\u0026rsquo;s that they\u0026rsquo;re still conducting sensitive changes to Chromium \u003ca href=\"https://bugs.chromium.org/p/chromium/issues/detail?id=896897\u0026amp;desc=2#c23\"\u003ein the open\u003c/a\u003e. I\u0026rsquo;m also not suggesting that Apple and Google are wholly wrong here. The pursuit of enhanced privacy while still allowing users to have some control over their browsers is a path filled with compromises. And since browser makers aren\u0026rsquo;t going to \u003cem\u003enot\u003c/em\u003e evolve their products, I think it\u0026rsquo;s important that you understand the motives that may be driving their decisions.\u003c/p\u003e\n\n\u003chr /\u003e\n\n\u003cp\u003e(And now a brief primer on how ad blockers work for the non-tech savvy family members who read my site ♥. Ad blockers prevent certain webpage elements from displaying by (a) preventing your browser from talking to certain ad-related servers and (b) maintaining a custom list of elements that either you or the community at large have flagged as worth blocking. They do this by comparing requests your browser\u0026rsquo;s resource requests against a list of tens of thousands of text patterns—if a request matches one of these rules, the content is blocked.  When using an ad blocker, browsing the web should feel faster, because your browser no longer has to wait on five different ads to download or tracking scripts to execute. Take a site like \u003cem\u003eThe Verge\u003c/em\u003e, the well-known tech site/advertisement billboard. Without an ad blocker installed, \u003cem\u003eThe Verge\u0026rsquo;s\u003c/em\u003e homepage weighs in at 5.8 MB with over 350 network requests to (I assume) ad and tracking servers. However, if you install an ad blocker \u003ca href=\"https://github.com/gorhill/uBlock\"\u003elike uBlock Origin\u003c/a\u003e, \u003cem\u003eThe Verge\u0026rsquo;s\u003c/em\u003e homepage now only weighs 4.2 MB with fewer than 50 network requests.)\u003c/p\u003e\n\u003cdiv\u003e\u003ca title=\"Permanent link for Proposed Changes to Chrome Would Hamper Ad Blockers\" href='https://audaciousfox.net/linked/2019/chrome-ad-blockers'\u003e\u0026nbsp;\u0026#9650;\u0026#65038;\u0026nbsp;\u003c/a\u003e\u003c/div\u003e\n"
            }
        
        , 
            {
               
                "title": "Twitter Begins Rolling out ‘Lite’ Version of Website to Everyone",
                "external_url": "https://mobile.twitter.com/Twitter/status/1087791357756956680",
                 
          "url": "https://audaciousfox.net/linked/2019/twitter-lite-rolls-out-to-everyone/",
                "date_published": "2019-01-23T19:50:55-05:00",
                "id": "https://audaciousfox.net/linked/2019/twitter-lite-rolls-out-to-everyone/",
                "author": {
                  "name" : "K.Q. Dreger"
                },
                "content_html": "\u003cp\u003eTwitter\u0026rsquo;s calling it the \u0026ldquo;new twitter.com\u0026rdquo;, but this update \u003ca href=\"https://blog.twitter.com/en_us/topics/product/2017/introducing-twitter-lite.html\"\u003eis clearly the lite variant\u003c/a\u003e of their website that mobile users have been using for over a year. Good on them for pushing this out to everyone—I\u0026rsquo;ve found it to be significantly faster and nicer to use than the normal site. It\u0026rsquo;s also (\u003ca href=\"https://www.theverge.com/2018/2/16/17021960/twitter-mac-desktop-app-discontinued-support-ending\"\u003esadly\u003c/a\u003e) the best official way to use Twitter on your Mac.\u003c/p\u003e\n\n\u003cp\u003eIf you\u0026rsquo;re still seeing the old/current version, you can check out what\u0026rsquo;s coming by going directly to \u003ca href=\"https://mobile.twitter.com\"\u003emobile.twitter.com\u003c/a\u003e.\u003c/p\u003e\n\u003cdiv\u003e\u003ca title=\"Permanent link for Twitter Begins Rolling out ‘Lite’ Version of Website to Everyone\" href='https://audaciousfox.net/linked/2019/twitter-lite-rolls-out-to-everyone'\u003e\u0026nbsp;\u0026#9650;\u0026#65038;\u0026nbsp;\u003c/a\u003e\u003c/div\u003e\n"
            }
        
        , 
            {
               
                "title": "Netflix Says ‘Fortnite’ is a Bigger Competitor Than HBO or Hulu",
                "external_url": "https://www.polygon.com/2019/1/17/18187400/netflix-vs-fortnite-hbo-hulu-competition",
                 
          "url": "https://audaciousfox.net/linked/2019/netflix-vs-fortnite/",
                "date_published": "2019-01-22T22:51:32-05:00",
                "id": "https://audaciousfox.net/linked/2019/netflix-vs-fortnite/",
                "author": {
                  "name" : "K.Q. Dreger"
                },
                "content_html": "\u003cp\u003eMatt Patches, \u003cem\u003ePolygon\u003c/em\u003e, reporting on Netflix\u0026rsquo;s latest quarterly earnings report:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003e[\u0026hellip;] Netflix estimated that it commands 10 percent of television screen time in the U.S., and slightly less than that for total mobile screen time. In other countries, the percentages are lower due to \u0026ldquo;lower penetration of our service.\u0026rdquo; The reason, Netflix said, isn\u0026rsquo;t because of obvious streaming competition, but of online platforms and video games.\u003c/p\u003e\n\n\u003cp\u003e\u0026ldquo;We compete with (and lose to) \u003ca href=\"https://www.polygon.com/game/fortnite/2417\"\u003e\u003cem\u003eFortnite\u003c/em\u003e\u003c/a\u003e more than HBO,\u0026rdquo; the report indicated. \u003c/p\u003e\n\n\u003cp\u003eBy the end of 2018, Netflix claimed nearly 139 million paying memberships worldwide. Meanwhile, in November 2018, Epic reported that its blockbuster battle royale game commanded \u003ca href=\"https://www.bloomberg.com/news/articles/2018-11-26/fortnite-now-has-200-million-players-up-60-from-the-last-count\"\u003eupwards of 200 million\u003c/a\u003e registered users. In its quarterly report, Netflix made clear that \u0026ldquo;consumer screen time\u0026rdquo; is its most valuable metric, and that \u003cem\u003eFortnite\u003c/em\u003e — just one of endless options for plugged-in audiences \u0026ndash; offers the stiffest competition.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eThat \u003cem\u003eFortnite\u003c/em\u003e impacts Netflix more than HBO should be a clear indicator as to why Netflix expects to \u003ca href=\"https://variety.com/2019/digital/news/netflix-content-spending-2019-15-billion-1203112090/\"\u003espend almost $15 billion on content this year\u003c/a\u003e. Netflix isn\u0026rsquo;t competing with HBO because HBO also makes content, Netflix competes with HBO because when you\u0026rsquo;re watching HBO you\u0026rsquo;re not watching Netflix. Sure, you could be paying for both, but once the attention scales tip too far in one direction, people begin to wonder if they really need that extra monthly subscription. Where attention goes, money follows.\u003c/p\u003e\n\n\u003cp\u003eThis is why features like \u003ca href=\"https://support.apple.com/en-us/HT208982\"\u003eScreen Time on iOS\u003c/a\u003e are so interesting to me\u0026ndash;they provide cold, hard numbers as to where I\u0026rsquo;m actually spending my time. Like Mint or \u003ca href=\"https://www.youneedabudget.com\"\u003eYNAB\u003c/a\u003e for your minutes. An attention budget.\u003c/p\u003e\n\n\u003cp\u003eIt\u0026rsquo;s not just screen things, either. Netflix shows, Facebook status updates, \u003cem\u003eFortnite\u003c/em\u003e matches, wood carving, genoise sponge cake baking are all\u0026ndash;in some manner\u0026ndash;competing for your attention. \u003ca href=\"https://en.wikipedia.org/wiki/Attention_economy\"\u003eThe attention economy\u003c/a\u003e posits that as content becomes increasingly available, attention (read: time) becomes a scarce commodity. If 200 million people started regularly baking genoise in the evenings instead of watching Netflix, you can bet we\u0026rsquo;d hear Reed Hastings say \u0026ldquo;sponge cakes\u0026rdquo; in the next quarterly report.\u003c/p\u003e\n\n\u003cp\u003e(Once you start thinking about the digital services and apps we use as primarily chasing your attention instead of your dollars, it becomes easier to see how addictive and downright manipulating some of these user interfaces have become. But that’s for another post.)\u003c/p\u003e\n\u003cdiv\u003e\u003ca title=\"Permanent link for Netflix Says ‘Fortnite’ is a Bigger Competitor Than HBO or Hulu\" href='https://audaciousfox.net/linked/2019/netflix-vs-fortnite'\u003e\u0026nbsp;\u0026#9650;\u0026#65038;\u0026nbsp;\u003c/a\u003e\u003c/div\u003e\n"
            }
        
        , 
            {
               
                "title": "‘Signal v Noise’ Officially Exits Medium",
                "external_url": "https://m.signalvnoise.com/signal-v-noise-exits-medium/",
                 
          "url": "https://audaciousfox.net/linked/2019/svn-exits-medium/",
                "date_published": "2019-01-17T21:34:37-05:00",
                "id": "https://audaciousfox.net/linked/2019/svn-exits-medium/",
                "author": {
                  "name" : "K.Q. Dreger"
                },
                "content_html": "\u003cp\u003eFinal nail, meet coffin.\u003c/p\u003e\n\n\u003cp\u003eHere with the follow-up to their \u003ca href=\"https://audaciousfox.net/linked/2018/signal-v-noise-leaving-medium/\"\u003eannouncement last September\u003c/a\u003e is CTO and co-founder of Basecamp, David Heinemeier Hansson:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003eThese days Medium is focused on their membership offering, though. Trying to aggregate writing from many sources and sell a broad subscription on top of that. And it’s a neat model, and it’s wonderful to see Medium try something different. But it’s not for us, and it’s not for Signal v Noise. [\u0026hellip;]\u003c/p\u003e\n\n\u003cp\u003eBeyond that, though, we’ve grown ever more aware of the problems with centralizing the internet. Traditional blogs might have swung out of favor, as we all discovered the benefits of social media and aggregating platforms, but we think they’re about to swing back in style, as we all discover the real costs and problems brought by such centralization. [\u0026hellip;]\u003c/p\u003e\n\n\u003cp\u003eThat doesn’t mean we regret our time at Medium. Being on Medium helped propel \u003ca href=\"https://m.signalvnoise.com/lets-bury-the-hustle/\"\u003esome\u003c/a\u003e \u003ca href=\"https://m.signalvnoise.com/is-group-chat-making-you-sweat/\"\u003eof\u003c/a\u003e \u003ca href=\"https://m.signalvnoise.com/reconsider/\"\u003eour\u003c/a\u003e \u003ca href=\"https://m.signalvnoise.com/give-it-five-minutes/\"\u003ebest\u003c/a\u003e \u003ca href=\"https://m.signalvnoise.com/why-we-choose-profit/\"\u003ewriting\u003c/a\u003e to a whole new audience. But these days there’s less of a “what Medium is doing for us”, and a whole lot more of “what we’re doing for Medium”. It was a good time while it lasted, but good times are gone.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eTheir new site is powered by WordPress and it looks freaking great. The theme was designed by Basecamp\u0026rsquo;s in-house designer Adam Stoddard, and I\u0026rsquo;m really digging his choice to set everything in \u003ca href=\"https://klim.co.nz/retail-fonts/tiempos-headline/\"\u003eTiempos\u003c/a\u003e. (I mean, \u003ca href=\"https://m.signalvnoise.com\"\u003ego \u003cem\u003elook\u003c/em\u003e\u003c/a\u003e at those big, bold, beautiful headlines.)\u003c/p\u003e\n\n\u003cp\u003eUnfortunately, Basecamp wasn\u0026rsquo;t able to export any of the comments on their old posts. This is disappointing because \u003cem\u003eSvN\u003c/em\u003e comments are those rare type of comments you actually want to read. To have them locked forever in Medium is a not-insignificant loss.\u003c/p\u003e\n\n\u003cp\u003eAs far as traditional blogs swinging \u0026ldquo;back into style\u0026rdquo;, I do hope that\u0026rsquo;s the case. Most of my favorite, non-news Internet content is the work of around 20 different writers, programmers, designers, and thinkers that I\u0026rsquo;ve stumbled across and subscribed to over the years. I list a few of my favorites \u003ca href=\"https://audaciousfox.net/masthead#other-writers-worth-reading\"\u003eover here\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003eAs a side note: If you\u0026rsquo;re new to the blogging scene, welcome. There\u0026rsquo;s never been a better time to start writing your own site, nor have there been more platforms and frameworks that give \u003cem\u003eyou\u003c/em\u003e control over your content and its presentation. And if you need help? \u003ca href=\"https://audaciousfox.net/masthead/\"\u003eShoot me an email\u003c/a\u003e—I\u0026rsquo;d love to help you out.\u003c/p\u003e\n\u003cdiv\u003e\u003ca title=\"Permanent link for ‘Signal v Noise’ Officially Exits Medium\" href='https://audaciousfox.net/linked/2019/svn-exits-medium'\u003e\u0026nbsp;\u0026#9650;\u0026#65038;\u0026nbsp;\u003c/a\u003e\u003c/div\u003e\n"
            }
        
        , 
            {
               
                "title": "Doist Switches From Medium to WordPress",
                "external_url": "https://doist.com/blog/",
                 
          "url": "https://audaciousfox.net/linked/2019/doist-leaves-medium-for-wordpress/",
                "date_published": "2019-01-13T11:51:32-05:00",
                "id": "https://audaciousfox.net/linked/2019/doist-leaves-medium-for-wordpress/",
                "author": {
                  "name" : "K.Q. Dreger"
                },
                "content_html": "\u003cp\u003eLooks like Doist started with Medium \u003ca href=\"https://web.archive.org/web/*/http://blog.doist.com\"\u003ein 2017\u003c/a\u003e, and then switched to WP Engine—a WordPress hosting service—earlier this month.\u003c/p\u003e\n\n\u003cp\u003e(You might not recognize Doist-the-company, but you\u0026rsquo;ve probably heard of their most popular product: \u003ca href=\"https://todoist.com\"\u003eTodoist\u003c/a\u003e, the much loved cross-platform task manager.)\u003c/p\u003e\n\u003cdiv\u003e\u003ca title=\"Permanent link for Doist Switches From Medium to WordPress\" href='https://audaciousfox.net/linked/2019/doist-leaves-medium-for-wordpress'\u003e\u0026nbsp;\u0026#9650;\u0026#65038;\u0026nbsp;\u003c/a\u003e\u003c/div\u003e\n"
            }
        
        , 
            {
               
                "title": "Yuibco Releases Lightning Compatible Security Key for iPhone",
                "external_url": "https://www.theverge.com/2019/1/8/18172193/yubico-security-key-lightning-connection-iphone-2fa-ces-2019",
                 
          "url": "https://audaciousfox.net/linked/2019/yubico-lightning/",
                "date_published": "2019-01-12T09:46:42-05:00",
                "id": "https://audaciousfox.net/linked/2019/yubico-lightning/",
                "author": {
                  "name" : "K.Q. Dreger"
                },
                "content_html": "\u003cp\u003eRussell Brandom, \u003cem\u003eThe Verge\u003c/em\u003e:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003eYubico has announced a new version of its popular Security Key for use in Lightning ports, the first such device to enable physical token authentication for iPhones. The device also supports a USB-C connection.\u003c/p\u003e\n\n\u003cp\u003ePreviously, the only way to connect a security key to an iPhone was over Bluetooth, which suffered Bluetooth’s normal usability issues as well as potential security concerns around mistaken pairings. Android devices can also pair over NFC, but that functionality is impossible under iOS’s current NFC restrictions.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eYubico wasn\u0026rsquo;t likely to ever make a Lightning-only security key because these keys are most useful when they\u0026rsquo;re device agnostic. iOS apps will have to add support for these sorts of keys, but it\u0026rsquo;s still nice that a Bluetooth-free security key option now exists for iPhone users.\u003c/p\u003e\n\n\u003cp\u003e(Brief primer on security keys, because I both use and recommend them: While a house key gets you into your home and a car key is required to start your vehicle—a physical Yubico security key can be a required part of your login flow for email, social media, etc. This makes those accounts almost impossible to hack, because an attacker would need your physical key. Additionally, I\u0026rsquo;ve found most people are (a) more willing to use and (b) faster to understand the concept of a physical key for your email; whereas explaining two-factor authentication codes can often take a few rounds of drawing before the idea takes.)\u003c/p\u003e\n\u003cdiv\u003e\u003ca title=\"Permanent link for Yuibco Releases Lightning Compatible Security Key for iPhone\" href='https://audaciousfox.net/linked/2019/yubico-lightning'\u003e\u0026nbsp;\u0026#9650;\u0026#65038;\u0026nbsp;\u003c/a\u003e\u003c/div\u003e\n"
            }
        
    ]
}